[
    {
        "id": "x2etjk",
        "title": "Account Development Manager",
        "createdAt": "Thu Jul 26 2018",
        "location": "Ramat Gan",
        "company": "Google",
        "description": "Identifies development potential in accounts by studying current business; interviewing key customer personnel and company personnel who have worked with customer; identifying and evaluating additional needs; analyzing opportunities. Initiates sales process by building relationships; qualifying potential; scheduling appointments. Develops sales by making initial presentation; explaining product and service enhancements and additions; introducing new products and services. Develops new applications by preparing specifications; conferring with product engineering. Closes sales by overcoming objections; preparing contracts.",
        "jobTypeIcon": ""
    },
    {
        "id": "nqvoökernvä",
        "title": "Front End Developer",
        "createdAt": "27 days ago",
        "location": "Tel Aviv-Yafo",
        "company": "Millentrix",
        "description": "· Planning, designing and implementation of different server and client side features including end-to-end development.          · Developing of UI components for front and back office systems                  · Bring mockups and sketches to life including responsive UI support                  Technologies we use:                  · Server: .Net Core 2                  · Client: AngularJS, React, Javascript,                  · Data store: MS SQL, Redis                  · Cloud platform: AWS                  Requirements:                  · At least 4 years of experience with end-to-end development - MUST                  · Proven experience of building responsive web applications with ReactJS (Angular 4/5 - advantage) - MUST                  · Deep knowledge of JavaScript, HTML5, CSS3 - MUST                  · Excellent design skills with deep knowledge of design patterns, DDD, OOD, microservice - MUST                  · Proven experience in building complicated systems in .NET environment - ADVANTAGE                  · Experience with .NET core, Cloud, FinTech, building Back Office systems - ADVANTAGE                  · Fluent English - MUST· Bsc./BA in Computer Science or related degree - ADVANTAGE",
        "jobTypeIcon": ""
    },
    {
        "id": "jg4p389zj",
        "title": "Administrative Assistant",
        "createdAt": "",
        "location": "Tel Aviv-Yafo",
        "company": " Facebook ",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.We are seeking an experienced administrative assistant to support 1 - 2 Engineering Managers. The right person will be able to manage a heavy workload efficiently and have a great ability to forge strong relationships with co-workers across the globe. Being able to cope in an incredibly fast paced environment with a variety of personalities is essential as is being able to adapt to Facebook's working culture with its many different methods of internal communication. We are seeking someone who is organised, passionate about Facebook's mission, and willing to get stuck in and embrace the social aspect of the role. This is a full time position, based in Tel Aviv.   Responsibilities:  Schedule all internal and external meetings across different time zones, while making decisions on priorities and importance of the meeting requests Manage all aspects of international travel Assist with creative internal team off-sites, and constantly searching for new and exciting ways to strengthen team culture Create and submit accurate expense reports on a timely basis Coordinate Faceversaries/Birthdays celebrations Managing and welcoming visitors from global offices and providing an ad hoc support when required Ensure email groups, aliases, and administrative systems are maintained and current PO management: raise POs in line with procur",
        "jobTypeIcon": ""
    },
    {
        "id": "ßbktr",
        "title": "Full Stack Developer",
        "createdAt": "10 days ago",
        "location": "Rogers, AR",
        "company": " OneStone Solutions Group",
        "description": "Retail has changed and is continuing to change.    OneStone exists to transform CPG (Consumer Packaged Good) companies’ eCommerce merchandising, operations and analytics across all major retail technology platforms including Amazon.com, Walmart.com, Jet.com, Boxed.com, etc.    OneStone is a tech-driven service group with a basecamp in Bentonville, Arkansas and additional offices located in Seattle, Denver, and Minneapolis.    OneStone’s team consists of statisticians, engineers, programmers and supply chain experts. Because OneStone’s business model is not a SaaS driven operation, team members have the freedom to take on unique challenges focusing on differentiated solves within the retail landscape.    We're looking for candidates with the following traits and experience:  - 3+ years software development (full-stack capabilities)  - Language experience in one of C#, Python, Javascript, or related modern languages  - Experience working in modern web frameworks (Node, ASP.NET, PHP, etc.)  - SQL and relational databases and source code control (SVN, Git, etc.)  - Statistical programming such as R, SAS, etc.  - Deep learning and neural networks  - Understanding of DevOps functions (CI, Unit Testing, Deployment, etc.)  - Knowledge of best-practice security fundamentals    HOWEVER if you are a disciplined computer science engineer and work in areas outside what is listed above, please drop us a line at connect@onlyonestone.com - We'd love to talk with you!",
        "jobTypeIcon": ""
    },
    {
        "id": "98h4",
        "title": "Storage Technical Specialist",
        "createdAt": "",
        "location": "Tel Aviv-Yafo",
        "company": "Lenovo",
        "description": "Position Description  Are you a Storage Technical Specialist ? Do you love datacenter computing and storage solutions?   Lenovo will drastically enhance its Storage products portfolio and is looking for a passionate and enthusiastic Storage Technical person for Lenovo’s storage current and future portfolio including block/file/AFA storage.  .  As a Lenovo Storage Technical Specialist in Lenovo’s datacenter group you will get engaged in promoting Lenovo DCG solutions and products. You will work with CTOs, IT decision makers, Lenovo pre-sales and sales teams, with Lenovo partners and ISVs. Your goal and target is to drive Lenovo’s data center opportunities through the sales cycle, from understanding customer business and technical requirements, building the solution architecture and driving the opportunity up to a closing.   You will be in charge of enabling our data center partners, preparing RFI and RFP responses, presenting solutions and carrying out proofs of concept.  For our FR Region, we are looking for a strong Storage Technical Specialist. This job role includes: Building and maintaining customer relationships to Technical Director level and above. Keeping customers up to date with new technologies and innovations relevant to their industry Identifying customer projects and interpreting their technical requirements Have the ability to build technical solutions working with the wider specialist product and technical community, the sales teams and business partners as appropriate, to support winning the business. Lead and/or provide Technical Input to Tenders/ RFIs/RFPs Gathers information to develop an accurate understanding of customer technology infrastructure Adapts solution design, Storage solutions to new requirements Proactively supports the account teams with product advice, presentations, proposal support  Position Requirements Position Requirements: Around 5-10 years of experience supporting enterprise sales of Converged solution (storage, networking, virtualization) and/or Storage solution to larg",
        "jobTypeIcon": ""
    },
    {
        "id": "1bkjbuhö",
        "title": "Senior Web Application Developer",
        "createdAt": "",
        "location": "Reno, NV",
        "company": "Talage Insurance",
        "description": "Senior Web application developer Talage is a well-funded Reno-based start-up that is attacking the small business insurance space, a massive market that is ripe for major disruption. Today we are made up of three co-founders and a developer. We are looking to expand our team to help us go from exciting start-up to industry heavyweight.   We are looking for individuals that are comfortable with the unknown, that have built amazing things with little direction, that can’t wait to help build a company from the ground up and most importantly are excited about doing something that has never been done before.  WHO WE’RE LOOKING FOR  Are you passionate about web development? Do you get excited about tackling new and complex problems? Are you self-motivated and enjoy learning new things? Are you always thinking of newer, better ways of doing things?   If your answer to these questions is an enthusiastic “yes,” you could be who we are looking for!  EXPERIENCE YOU MUST HAVE 5+ years web development experience PHP – intermediate to advanced proficiency Node.js MVC Frameworks Object Oriented Programming Database Design and Optimization - MySQL Writing Maintanable, Well-Documented Code Ability to Think Critically and Move Quickly RESTful API design/development Font-End Development: HTML, CSS/SASS, JQuery OPTIONAL EXPERIENCE Automated testing - We use Ava Bootstrap GitHub Joomla! 3.x Writing documentation - We use Docsify PERKS Stock options 401(k) Full Medical, Dental, Vision, and Life Insurance - 100% Employer Paid Flexible schedule Unlimited vacation Join a thriving Reno startup More… (we are just getting started) ABOUT TALAGE  Talage is a first-of-its-kind digital insurance agency that offers small business insurance online. We have partnered with 8 national AM Best A Rated insurance carriers to offer the first ever online comparison shopping experience.   Talage recently completed the San Francisco-based Acceleprise accelerator program and is backed by Silicon Valley VCs. ",
        "jobTypeIcon": ""
    },
    {
        "id": "+pß34g",
        "title": "Account manager",
        "createdAt": "",
        "location": "Tel Aviv-Yafo",
        "company": " Gimmonix",
        "description": "We Are Gimmonix  Gimmonix is a rapidly growing travel technology company at the forefront of solving some of the most complex challenges in the travel industry. We’re looking for a driven candidate to join our team as an account manager.  The responsibilities  Responsible to manage the customer after signature and ongoing process Demonstrate product functionality and features Educate customers about new features Advise on new product and features that would be relevant for their business Conduct follow-ups and check-in calls/emails Collect and present user feedback to product management to influence development priorities and future roadmap Maintain ongoingly relationship with the customer. Be the point of contact between the Business Development Team, Product, technical and Success team for certain clients. Requirements  At least 3 years experience at the same role Experience in managing high value strategic clients and partners English at mother tongue level, Spanish a must ( portuguese and others a plus) Project management skills and cross team communication expert; work with finance, legal, engineering, sales, and product. Strong written and verbal communication skills – preparing presentations, summaries and written reports. The ability to effectively prioritize tasks and meet requirements for timeliness and accuracy Flexible and able to adapt in changing and growing company Proficient in Microsoft Excel and large data analysis. Have a Bachelor’s degree (BA/BSc) in exact science, marketing, business or related field. Willing to travel",
        "jobTypeIcon": ""
    },
    {
        "id": "mvpä454",
        "title": "IT Support Engineer (w/m)",
        "createdAt": "",
        "location": "Vienna",
        "company": "Roche",
        "description": "You’re someone who wants to influence your own development. You’re looking for a company where you have the opportunity to pursue your interests across functions and geographies. Where a job title is not considered the final definition of who you are, but the starting point. -> Who we are  At Roche, 94,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.   Roche is an equal opportunity employer. Job facts  Location Austria, Vienna, Vienna Function Information Technology Subfunction IT Business Process Analysis Schedule Full time Job level Individual contributor Job type Regular Division Diagnostics Posted since 2018/05/03 Job-ID 3590736409 Get in touch  Mrs. Sarah Pratter You could also like these jobs",
        "jobTypeIcon": ""
    },
    {
        "id": "9p8vhtr",
        "title": "Software Engineer",
        "createdAt": "",
        "location": "Vienna",
        "company": "SmartStream Technologies",
        "description": "Software Engineer AT18005  Vienna, Austria  This is a technical role where you will have an opportunity to work in a company with operations around the globe. You will be involved in designing, developing and implementing the financial products for the world’s leading retail banks. This role will be primarily responsible for the analysis, architectural design and implementation of a web framework.   Job Responsibilities Involvement in designing and developing of financial products for the world’s leading banks Design, develop and maintain the source code of the product using Java and Web technologies Build reusable code and libraries for future use Collaborate with other team members and key stakeholders Key Skills The successful candidate should have experience in: Java RCP, ECMAScript 6, GWT, JSP Application servers: JBoss, Wildfly, WebSphere, Weblogic Practical experience of SQL Knowledge of the usual Operating Systems (UNIX, Windows) Relational databases (primarily Oracle, DB2 and SQL Server) Desirable Skills In addition to the above, it would be advantageous to have the following: Experience in C++ 98/03, C++ 11, MFC, STL Experience in Javascript, Typescript, Node.js, AngularJS Qualifications and Experience Engineering Graduate with Computer Science / Information Technology background Experience in core Java programming with minimum 1 year experience in Java 7 SE, Java 7 EE 1 to 3 years of programming experience Benefits Competitive salary Open work culture Flexible working hours Additional holiday entitlement linked to length of service Lunch vouchers  Apply Now!",
        "jobTypeIcon": ""
    },
    {
        "id": ",.fe4",
        "title": "QA Engineer ($30K/yr) - Online Hiring Tournament",
        "createdAt": "6 days ago",
        "location": "Vienna",
        "company": " Crossover for Work",
        "description": "We're running an Online Hiring Tournament on August 4th to hire QA Engineers ($30K/yr).  This event will include all testing for the role. Upon grading the deliverables from the event, we will set up qualified candidates with an interview with the hiring manager. This is a 100% remote, full-time role.  Crossover is looking for QA Engineers to work on multiple products, technologies, and environments, documenting and automating high-quality test cases. Our software engineers are expected to perform a thorough testing activity regimen for each product, including setting up the test environments, writing automated/performance test cases, contributing to the continuous improvement of our test automation and performance testing frameworks, and performing manual tests if necessary.  You will be part of a team responsible for the technical delivery of a multi-million dollar revenue per year enterprise software product. That team is responsible to ensure that the customers are blown away by the technical differentiation and quality of the product.  We are empowering quality assurance and creating higher quality applications by using the latest technologies and toolsets. We are excited about using data to make decisions, we are bringing big data and analysis to software testing. We are on the cutting edge of quality assurance, and we innovate improvements on the newest technologies and techniques. We want people who are adaptable and can learn new things and can use new ideas and concepts to solve business problems.  Candidates Requirements:  Bachelor’s degree in Computer Science, Engineering or related fields 3+ years of QA experience – automated testing and performance testing (not mandatory), test case documentation and test cases automation Transforming use cases into automated tests using multiple test automation tools like Selenium, Protractor, RestAssured, CodedUI, Appium Understanding HTML,DOM, API 2+ years of hands-on software development experience in Java, C# or NodeJS – you should know the current software dev",
        "jobTypeIcon": ""
    },
    {
        "id": "xwc498",
        "title": "Web Search Evaluator - Russia",
        "createdAt": "",
        "location": "Russia",
        "company": " Appen",
        "description": "At Appen, we work with 8 out of the top 10 global technology companies in the world to improve and optimize their products for users worldwide, including social media platforms, search engines, voice recognition systems, and eCommerce sites. The world of tech is moving fast, and since our founding in 1996 we rose to the challenge by becoming a publicly listed company and by building an international team that works in over 130 countries and in more than 180 languages.   Do you like searching for information on the web, and wonder why you see the results you do? If so, we are looking for new members of our Web Search Evaluator team. As an evaluator, you perform basic tasks online such as providing feedback on search results, advertisements and web page content. Your input helps technology companies craft a fun and useful experience for people who are searching for information around the world.   You Might Fit This Role If: You are looking for a flexible work opportunity where you contribute to projects and grow your skills You use search engines every day You enjoy working independently You want to do internet-based work from home   Work Schedule: Web Search Evaluator positions are part-time (up to 20 hours per week) and highly flexible The usual position requires 1-4 hours of work per day, 5-7 days a week   Minimum Qualifications: Currently living in and legally permitted to work in Russia Access to a computer with a sound card and speakers, and/ or access to a smart phone that is less than three years old Access to a secure high speed internet connection Basic level of computer operational knowledge, including experience using the internet and performing searches Good English writing skills   We take pride in our diverse team and our flexible work opportunities, and as a publicly traded company our efforts and earned us the first place ranking in the FlexJobs Top 100 Companies index. Deloitte also recognized Appen with the 2017 Asia Pacific Technology Fast 500 and the Technology Fast 50 Australia awards.   We ar",
        "jobTypeIcon": ""
    },
    {
        "id": "mp94ü5",
        "title": "Web Developer/ JavaScript",
        "createdAt": "Today",
        "location": "Saint Petersburg",
        "company": " Veeam",
        "description": "Seeking new career opportunities? Consider taking on an exciting and challenging role at Parallels. We are a private, profitable and rapidly growing global software company with offices in 14 countries. Discover a career you love and contribute to our continued success in leading the innovation of cloud services enablement and desktop virtualization. We are recruiting for many roles around the world, including this one: Web Front-end Developer  Responsibilities: ? Development of web front-end for Parallels projects: Parallels Access, Parallels MyAccount, Parallels Desktop, creating best world class consumer products. ? General Front-end development processes improvement. ? Learn new technologies and platforms  Requirements: ? BS or MS degree in computer science or engineering ? 3+ years of web development (HTML, CSS, JavaScript) ? Extensive expertise for web front-end development ? High level JavaScript, desirable experience in MVVM frameworks, AMD, require.js, Knockout, node.js, Grunt. ? Posses HTML, CSS, HTML5 and CSS3 knowledge will be plus Ability and knowledge of backend part Python/Django will be a big plus. ? Put thoughts into Russian words correctly ? Eager to learn and improve your skills  Parallels is a Red Herring Global 100 winner, an award that is given to the leading private companies from North America, Europe and Asia, recognizing their innovations and technologies across their respective industries.  Our Parallels Desktop for Mac software is the worldwide leader in enabling users to run Windows applications on a Mac without rebooting, with a 78 percent market share1 and is used by more than 50 percent of Fortune 200 companies.   Parallels Hosting and Cloud Service Delivery solutions enable service providers to deliver and profitably grow hosting and cloud services for more than 148 million small businesses worldwide. And thats just the beginning.  Founded in 1999, Parallels offers a dynamic environment at a truly global company with more than 950 employees, 10 million customers, and 800 partners",
        "jobTypeIcon": ""
    },
    {
        "id": "cn4oö5",
        "title": "Data Scientist",
        "createdAt": "",
        "location": "Vienna",
        "company": "SMARTASSISTANT",
        "description": "Have you ever shopped online and didn’t really know which of the thousands of products to pick? Or have you been shopping in a store but there was no one in sight to help you with choosing the right product? We develop and distribute software that solves these issues!   SMARTASSISTANT is the market-leading solution for interactive Guided Selling solutions. Our technology is used by multiple global businesses from Fortune 500 companies like Canon, Goodyear, Procter & Gamble to small and medium-sized enterprises.   We are driven by our mission to help people make better decisions and together work on turning a bold vision into reality. At SMARTASSISTANT, you'll meet open-minded and genuinely caring professionals from many different walks of life. We are growing fast and always looking for talented, ambitious and smart people who are ready to make things happen.   WHAT WILL YOU DO?   As a Data Scientist at SMARTASSISTANT, your tasks will comprise: Leading Machine Learning projects related to our Digital Advice Technology Working on our behavioral user data, deriving data models and deriving and implementing concepts for Machine Learning projects in Python and TensorFlow Providing knowledge and reports and findings to the product, engineering and management team Providing findings and results of Data Mining activities linked to our behavioral user data Working closely with our product and engineering team and providing guidance for the implementation of new Machine Learning functions of our technology WHO ARE WE LOOKING FOR?   It is definitely you we're looking for, if you possess: Minimum of a Bachelor’s degree in Statistics, Mathematics, Informatics, Data Science, Physics or similar and 3+ years working in an advanced analytics role OR a Master’s degree in one of these subjects and at least a year of work experience. Alternatively we can also offer a part-time position during a PhD or doctor studies. Strong skills in understanding data, data concepts and data engineering as well as cleaning data and deriving data m",
        "jobTypeIcon": ""
    },
    {
        "id": "c36458",
        "title": "Ui / Ux",
        "createdAt": "New",
        "location": "Saint Petersburg",
        "company": " CORE",
        "description": ": web, desktop : Adobe Photoshop Adobe Illustrator :",
        "jobTypeIcon": ""
    },
    {
        "id": "cmü3c453",
        "title": "Data Scientist, IT Innovation",
        "createdAt": "",
        "location": "Gerasdorf bei Wien",
        "company": "Borealis",
        "description": "Data Scientist, IT Innovation  Do you want to join the Data Science and Analytics team of Borealis? We are currently looking for a Data Scientist. If you are passionate about data and analytics and want to support IT Innovation, if you are not afraid to roll up your sleeves and to take on serious responsibilities, you have come to the right place. As a Data Scientist at Borealis you apply state of the art techniques to translate business needs into automated data models. You use machines to study algorithms, data mining and programming technics, in order to support business leaders and end users to gain new insights and make data-driven predictions as well as decisions.   Your main areas of responsibility include amongst others: You work with customers to understand their business requirements and desired solutions You assist in scoping and designing data analytics projects and solutions You manage data ingestion and migration from various (internal and external) sources (data extraction, consolidation). Handle both structured and unstructured data You apply adequate repository technologies, make proposals on the level of detail to apply for the analysis You transform, clean and store data in the agreed structure You build and test prescriptive and predictive data models and applications to identify complex patterns in the context of the agreed specification You apply visualisation technics to express and communicate clearly actionable insights resulted by the analysis, contribute to the development of recommendations to management on the further steps in the utilisation of the results You deploy models in production taking into account performance and scalability You manage the end-to-end cycle of data analytics projects with medium level of complexity. You perform the tasks related to the maintenance of the analytics tools and infrastructure, including monitoring the accuracy of deployed models. You escalate any request which may result in data security exposure You are the right candidate for this position if ",
        "jobTypeIcon": ""
    },
    {
        "id": "f344t2",
        "title": "Financial analyst",
        "createdAt": "27 days ago",
        "location": "Saint Petersburg",
        "company": " NEC Europe ",
        "description": "Main Duties of the Role: Monthly corporate reporting preparation: PL, BS, CF: gathering reporting table data & 1C data, analysis, checking & final reports preparation & approval; AR overdue report: gathering data, analysis & approval on monthly base ; Others corporate report preparation & approval on monthly base; Participation in Budget preparation: PL, BS, CF on year base. The maintenance of the Table of contracts accounting and monthly reporting and forecasting six months (OR, S, DPC, GM, AP, AR, Inventory) in terms of customers, products; Preparation of presentation materials for key customers; Invoicing for payment; current operational control over the receipt of cash from customers; Monthly Report on the status of receivables from customer Calculation and coordination for delay of payments and/ or deliveries. Schedule maintenance payments. Managerial accounting and control of investment and current expenditure on the development of new lines of business, short-term and long-term prognosis. The preparation of the financial part of the tender documentation. Collection of documents for daily payments for the Moscow branch, inventory and shipment documents. Preparation of contracts of insurance (property, cargo, commercial transactions) and monitoring their implementation. Analysis of impairment of inventories and fixed assets. Requirements: Education: degree in Economics.  Experience: from 3 years as a financial analyst and at least 2 years in the preparation of corporate financial statements  Knowledge 1C version 8.2,  Knowledge of IFRS  English language proficiency at least Intermediate level  Knowledge of principles and methods of taxation  Knowledge of legislative and regulatory legal documents defining requirements to financial and economic activity of the enterprise Knowledge of the principles of organization of financial work at the enterprise knowledge of the principles of business risk",
        "jobTypeIcon": ""
    },
    {
        "id": "ökäp9exf",
        "title": "Legal Secretary",
        "createdAt": "",
        "location": "Morgantown, WV",
        "company": " Bailey and Glasser ",
        "description": "The Morgantown office of Bailey & Glasser, LLP has an immediate opening for a legal secretary. This position will serve as receptionist for the office and assist attorneys with various duties such as typing, transcribing dictation, filing (both paper files and electronic), organizing files, preparing hearing notebooks, maintaining calendars, and other general office duties. The candidate will have extensive client telephone contact. Successful candidates need to be able to work independently and be a highly motivated and productive team player. The candidate will need to be able to work well under pressure, have strong organizational skills, be able to quickly learn new software programs, and be able to prioritize and multitask with high attention to detail. Excellent written and verbal communication skills are required. We offer a competitive salary and benefits package as well as a professional work environment. Candidates should have an associate degree or a minimum of five years of legal experience. Candidates may also have an equivalent combination of education and experience.",
        "jobTypeIcon": ""
    },
    {
        "id": "vnkt",
        "title": "Class A Truck Driver",
        "createdAt": "",
        "location": "Yadkinville, NC",
        "company": "Triad Metal Recyclers ",
        "description": "Class A CDL Driver   Get in the driver’s seat with a growing and locally-owned industry leader. We offer competitive pay, benefits, and career advancement opportunities.   Our Drivers are responsible for servicing customers with the hauling of waste, construction debris, and recyclables to a disposal site. Drivers will deliver, remove and haul containers or trailers to/from customer’s sites. This position may require driving in congested and/or confined areas. This position will be required to enter/exit the truck several times per day. Drivers may also be required to climb to hook/unhook containers, move items to smooth the load, and to secure tarps. The drivers are exposed to extreme weather conditions. The hours and physical demand may vary by route or area. This is a local driving job within the state of North Carolina.   RESPONSIBILITIES:   · Operate truck in a safe manner in compliance with all local, state, and federal regulations and company policies.   · Provide roll off delivery and removal services to customers on assigned route(s) or by work order.   · Maintain and update route sheets.   · Conduct pre-trip/post trip inspections and complete logs.   · Maintain and update drivers log sheets.   · Professional interaction with internal and external customers.   · Other duties as assigned.   REQUIREMENTS:   · Ability to read and understand a map.   · Ability to perform physical requirements of the job (prolonged physical exertions, including but not limited to: sitting, reaching, pushing, pulling, climbing and lifting).   · Excellent truck driving/maneuvering skills.   · Ability to drive truck with a manual transmission.   · General knowledge of mechanics of trucks.   · Ability to work overtime, weekends and/or holidays.   · Ability to work in all weather conditions.   · Good written and verbal communication skills to be able to communicate effectively and professionally with internal and external customers.   · Minimum 1 year CDL truck driving experience.   · Waste industry experience, a plus.   · Additio",
        "jobTypeIcon": ""
    },
    {
        "id": "5i309483",
        "title": "Dentist",
        "createdAt": "6 days ago",
        "location": "Santa Maria, CA",
        "company": "See Me Smile Dental",
        "description": "Our state-of-the-art dental practice is searching for a skilled and experienced Dentist with excellent communication skills to join our professional team. The ideal candidate for this position has worked with patients of all ages, is proficient in performing regular checkups and complex dental procedures and is committed to the highest quality of patient care. Those who are qualified and in search of a long-term career opportunity in a cutting edge practice are encouraged to submit a resume today.  REQUIREMENTS:  *Diagnose and provide appropriate dental treatment to patients, including regular cleanings, root canals, surgical extractions, cosmetic dentistry, ect. *Educate patients and parents of patients on maintaining proper oral health *Communicate with dental staff on our team regarding patient treatment plans and care *Prescribe medications as necessary *Carefully document all clinical notes, diagnoses, treatments and consultations *Schedule flexibility   QUALIFICATIONS: *DDS, DMD or DD required *Current license to practice dentistry *Valid malpractice liability insurance *Dedicated to ensuring the highest quality of care to patients *Excellent communication skills *Friendly and professional demeanor",
        "jobTypeIcon": ""
    },
    {
        "id": "52mö",
        "title": "Restaurant Manager",
        "createdAt": "13 days ago",
        "location": "North Little Rock, AR",
        "company": "Hideaway Pizza",
        "description": "Hideaway Pizza is accepting applications for Manager positions for the North Little Rock and Conway locations. Our Manager assist our General Managers in running all areas of the restaurant.  Some minimum requirements for an applicant: -Progressive work history -2+ years working in a full service restaurant -1+ years of supervisory/leadership experience   We look for people who can excel in the following: -Guest Focus -Communicating -Problem Solving/Decision Making -Executing Operational Standards -Managing Pressure -Developing Talent -Leading By Example -Managing Performance  Our benefits include: -Competitive Pay -Health/Dental/Vision/Life/Disability -2 Weeks of Flexible Paid Time Off Annually -Retirement Match -Uniform Shirts -Food Discounts and Manager Shift Meals -Growing Company since 1957 -Closed 6 Major Holidays  To Apply: - Go to hideawaypizza.com - Select Employment -Apply for a Manager position  We look forward to you being part of our growing team! Thank you!",
        "jobTypeIcon": ""
    }
]